SerendipityOne/ros-car-stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "ALL_DEFINE.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MOTOR4A_Pin GPIO_PIN_0
#define MOTOR4A_GPIO_Port GPIOA
#define MOTOR4B_Pin GPIO_PIN_1
#define MOTOR4B_GPIO_Port GPIOA
#define MOTOR2A_Pin GPIO_PIN_6
#define MOTOR2A_GPIO_Port GPIOA
#define MOTOR2B_Pin GPIO_PIN_7
#define MOTOR2B_GPIO_Port GPIOA
#define MOTOR3A_Pin GPIO_PIN_12
#define MOTOR3A_GPIO_Port GPIOD
#define MOTOR3B_Pin GPIO_PIN_13
#define MOTOR3B_GPIO_Port GPIOD
#define TB1_PWMA_Pin GPIO_PIN_6
#define TB1_PWMA_GPIO_Port GPIOC
#define TB1_PWMB_Pin GPIO_PIN_7
#define TB1_PWMB_GPIO_Port GPIOC
#define TB2_PWMA_Pin GPIO_PIN_8
#define TB2_PWMA_GPIO_Port GPIOC
#define TB2_PWMB_Pin GPIO_PIN_9
#define TB2_PWMB_GPIO_Port GPIOC
#define MOTOR1A_Pin GPIO_PIN_15
#define MOTOR1A_GPIO_Port GPIOA
#define TB1_AIN2_Pin GPIO_PIN_0
#define TB1_AIN2_GPIO_Port GPIOD
#define TB1_AIN1_Pin GPIO_PIN_1
#define TB1_AIN1_GPIO_Port GPIOD
#define TB1_BIN1_Pin GPIO_PIN_2
#define TB1_BIN1_GPIO_Port GPIOD
#define TB1_BIN2_Pin GPIO_PIN_3
#define TB1_BIN2_GPIO_Port GPIOD
#define TB2_AIN2_Pin GPIO_PIN_4
#define TB2_AIN2_GPIO_Port GPIOD
#define TB2_AIN1_Pin GPIO_PIN_5
#define TB2_AIN1_GPIO_Port GPIOD
#define TB2_BIN1_Pin GPIO_PIN_6
#define TB2_BIN1_GPIO_Port GPIOD
#define TB2_BIN2_Pin GPIO_PIN_7
#define TB2_BIN2_GPIO_Port GPIOD
#define MOTOR1B_Pin GPIO_PIN_3
#define MOTOR1B_GPIO_Port GPIOB
#define MPU6050_INT_Pin GPIO_PIN_5
#define MPU6050_INT_GPIO_Port GPIOB
#define MPU6050_INT_EXTI_IRQn EXTI9_5_IRQn
#define I2C1_SCL_Pin GPIO_PIN_6
#define I2C1_SCL_GPIO_Port GPIOB
#define I2C1_SDA_Pin GPIO_PIN_7
#define I2C1_SDA_GPIO_Port GPIOB
#define OLED_SCL_Pin GPIO_PIN_8
#define OLED_SCL_GPIO_Port GPIOB
#define OLED_SDA_Pin GPIO_PIN_9
#define OLED_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
